package day05;

public class Exam2 {
    public static void main(String[] args) {
        // [1] 객체란? '주체'가 아닌 의사나 행위를 미치는 대상. 타인, 손님 객
        // [2] 객체 종류 : 속성(값/ 의사) , 함수(기능/행위) 정의 가능한 것들
        // -> 사람(물리적), 주문(비물리적), 안경, 공기, 강의

        // [3] 객체지향 프로그래밍: 개발자(주체)가 컴퓨터 안에서 (객체) 대상 만들기
        // [4] 객체 정의는 '클래스'라는 설계도에서 속성 과 기능 코드로 정의한다.
        // -> 속성 : 대상(객체)의 본질/ 특징/ 성질  -> *멤버*변수
        // -> 기능 : 대상(객체)의 작동/행위/이벤트  -> *멤버*함수, 메소드(method)
        // *********** 자바의 모든 코드는 클래스 단위로 컴파일/번역(코드 -> 기계어) 한다. *********
        // [5] 클래스 용도(2)
            // 1) 실행용도로써 main함수를 갖는 클래스
            // 2) 객체 설계 용도로써 main함수를 갖지 않고, 멤버변수/ 멤버함수를 갖는 클래스
        // [6] 예시1
        // 학생 객체 설계: 1) 속성: 학번, 이름, 전화번호 등     2) 기능: 밥먹기(), 공부하기(), 잠자기() 등
        // 학생 객체 만들기 : 1) 클래스 만들기 2) 객체 생성 3) 객체 사용
        // (1) new; //인스턴스화 , 인스턴스를 만드는 키워드
        // (2) new 클래스명(); // 생성자, new 뒤로 생성자 == 클래스명 동일하며 ()인자값 갖는다.
        // (3) 클래스명 변수명 = new 클래스명(); // 객체생성 : 동일한 클래스/타입 명으로 변수 선언하여 저장한다.
        Student s1 = new Student();
        System.out.println("s1 = " + s1); // day05.Student@776ec8df 저장된 위치/주소
        
        
    }// main end
}// class end

// class 밖에서 또다른 class 만들기 : 현재 코드 작성하는 파일은 class파일이 아닌 .java파일이다.
// 즉] .java 파일에는 여러개 class가 존재할 수 있다.
class Student{ // 1) class 클래스명{}
    int studentID; // 2) '학생번호'속성, 2) 멤버변수 정의 = 객체의 본질/특징/성질/값
    String studnetName; // '학생명' 속성
} // class end // 설계도 단점 : 복잡도가 올라간다. 장점: 재사용이 빠르다.
